mager-m/openbsw/executables/referenceApp/platforms/esp32/idf_project/sdkconfig.defaults
# ESP-IDF configuration defaults for Arduino Nano ESP32 (ESP32-S3)

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=16
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# System
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Panic handler — print backtrace over UART then reboot
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y

# Verbose logging for debugging
CONFIG_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_LOG_DEFAULT_LEVEL=5

# Console via UART0 (GPIO43/44 on Arduino Nano ESP32 header pins)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# Also enable USB Serial/JTAG as secondary console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y
